app/views/notes/show.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."patient_id" = $1  [["patient_id", 1]]
---
<ul>
  <% @patient.notes.each do |note| %>