app/controllers/notes_controller.rb

INSERT INTO "notes" ("text", "patient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", nil], ["patient_id", 1], ["created_at", "2025-03-11 13:48:05.338883"], ["updated_at", "2025-03-11 13:48:05.338883"]]
---
  def create
    @note = @patient.notes.build(note_params)
    if @note.save

UPDATE "notes" SET "text" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["text", "2/notes/new notes créer à 16h22 jhjhlk"], ["updated_at", "2025-03-11 15:56:25.481928"], ["id", 14]]
---
  def update
    if @note.update(note_params)

DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 12]]
---
  def destroy
    @note.destroy!

SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_patient
    @patient = Patient.find(params[:patient_id])

SELECT "notes".* FROM "notes" WHERE "notes"."patient_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["patient_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_note
    @note = @patient.notes.find(params[:id])